# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [13]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

Next, import `Orders` from Ironhack's database into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [14]:
orders = pd.read_csv('orders.csv')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [18]:
customers_orders = orders.groupby('CustomerID').agg({'amount_spent': 'sum'})
customers_orders.head()

            amount_spent
CustomerID
12346           77183.60
12347            4310.00
12348            1797.24
12349            1757.55
12350             334.40

In [19]:
percentil_95 = np.percentile(customers_orders['amount_spent'],95)
percentil_75 = np.percentile(customers_orders['amount_spent'],75)

In [23]:
customers_orders['tipo_cliente'] = customers_orders['amount_spent'].apply(lambda x: 'vip' if x > percentil_95 else 'preferred' if x < percentil_95 and x > percentil_75 else 'normal')
customers_orders

      CustomerID  amount_spent tipo_cliente         Country
0          12346      77183.60          vip  United Kingdom
1          12347       4310.00    preferred  United Kingdom
2          12348       1797.24    preferred  United Kingdom
3          12349       1757.55    preferred  United Kingdom
4          12350        334.40       normal  United Kingdom
...          ...           ...          ...             ...
4334       18280        180.60       normal  United Kingdom
4335       18281         80.82       normal  United Kingdom
4336       18282        178.05       normal  United Kingdom
4337       18283       2094.88    preferred  United Kingdom
4338       18287       1837.28    preferred  United Kingdom

[4339 rows x 4 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [24]:
customers_orders['Country'] = orders['Country']
customers_orders.reset_index(inplace=True)
customers_orders

      index  CustomerID  amount_spent tipo_cliente         Country
0         0       12346      77183.60          vip  United Kingdom
1         1       12347       4310.00    preferred  United Kingdom
2         2       12348       1797.24    preferred  United Kingdom
3         3       12349       1757.55    preferred  United Kingdom
4         4       12350        334.40       normal  United Kingdom
...     ...         ...           ...          ...             ...
4334   4334       18280        180.60       normal  United Kingdom
4335   4335       18281         80.82       normal  United Kingdom
4336   4336       18282        178.05       normal  United Kingdom
4337   4337       18283       2094.88    preferred  United Kingdom
4338   4338       18287       1837.28    preferred  United Kingdom

[4339 rows x 5 columns]

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [26]:
customers_orders['tipo_cliente'] = customers_orders['amount_spent'].apply(lambda x: 'vip' if x > percentil_95 else 'preferred' if x < percentil_95 and x > percentil_75 else 'normal')

vip_pais = customers_orders.groupby('tipo_cliente').Country.value_counts()